IdeaRS.Connections
RibData Properties
Compatible with IDEA StatiCa 0.0
The RibData type exposes the following members.
Properties
Name | Description
BottomPlatePath
 Gets or sets the bottom plate to which rib plate is connected
Delta
 Gets or sets the distance between repeated ribs
FirstRibAzimuth
 Gets or sets the angle (azimuth) of the first rib on tube
Height
 Gets or sets the height of the plate
IncludeFirstCode
 If 3 - first and last rib is included (in case of repeating)
IsActive |  (Inherited from ConnectionCmdData.)
IsLastRib
 Is last radial rib
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NumberOfRibs
 Gets or sets the number of ribs (the property Delta represents the distance between repeating ribs)
Offset
 Gets or sets the offset of the rib from its default position
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Placement
 Gets or sets the placement on side plate
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
RadialRibCount
 Gets or sets the number of radial ribs
RibAngle
 Get or sets the angle which defines the area where radial ribs are placed
ShapeCode
 Gets or sets the code of the shape
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
SideCode
 Gets or sets the placement of the ribs relative to middle plane of the side plate
SideMemberPath
 Gets or sets the member to which rib plate is connected
SidePlatePath
 Gets or sets the side plate to which rib plate is connected
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the weld
Width
 Gets or sets the width of the plate
Top
See Also
Reference
RibData Class
IdeaRS.Connections.Data Namespace